#include <bits/stdc++.h>

using namespace std;

int factor[][3] = {
    {0, 0, 0}, 
    {1, 0, 0}, 
    {2, 0, 0},
    {3, 0, 0}, 
    {1, 1, 0}, 
    {0, 1, 0},
    {1, 1, 0},
    {2, 1, 0}, /// เช่น XII ถ้าเป็นหลักหน่วย และ LXX ถ้าเป็นหลักสิบ
    {3, 1, 0},
    {1, 0, 1}
};

int cnt[7]; /// [I, V, X, L, C, _, _]

/// เพิ่มค่าใน cnt โดย start_pos จะขึ้นอยู่กับว่าเป็นเลขในหลักใด
///     หลักหน่วย -- 0 เพื่อให้ไปบวกเพิ่ม ณ ตำแหน่ง [I, V, X]
///     หลักสิบ   -- 2 เพื่อให้ไปบวกเพิ่ม ณ ตำแหน่ง [X, L, C]
///     หลักร้อย  -- 4 เพื่อให้ไปบวกเพิ่ม ณ ตำแหน่ง [C, _, _]

int add(int start_pos, int num) {
    for(int i = 0; i < 3; i++) {
        cnt[start_pos + i] += factor[num][i];
    }
}

int main() {
    int d;
    cin >> d;

    for(int i = 1; i <= d; i++) {
        add(0, i % 10); /// หลักหน่วย
        add(2, (i / 10) % 10); /// หลักสิบ
        add(4, i / 100); /// หลักร้อย
    }

    for (int i = 0; i < 5; i++) {
        cout << cnt[i] << " ";
    }
    
    return 0;
}