#include <stdio.h>
int main()
{
    int r,c,center; //สร้างตัวแปร r , c , center;
    scanf("%d",&center); //รับค่าจำนวนเต็มไว้ในตัวแปร center;
    for (r = 0; r < center; r++) //ให้ r = 0; ถ้า r < center ให้วนลูปคำสั่งในปีกกา; เพิ่มค่า r ทุกครั้งที่ลูป;
    {
        for (c = 0; c <= r; c++)//ให้ c = 0; ถ้า c <= r ให้วนลูปคำสั่งในปีกกา; เพื่มค่า c ทุกครั้งที่ลูป;
        {
            printf("*");}//แสดงผล *
        printf("\n");}//สั่งตัดบรรทัด
    return 0;//จบการทำงาน ปรับค่ากลับเป็น 0
    
}